test/logs_soap_soak_crossVM/k6.log
     execution: local
        script: test_read_soakTest_soap.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1h4m30s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 1h4m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

WARN[0001] ⚠️ High response time: 859.420393ms | VU 1 | 2025-04-17T10:46:49.473Z  source=console


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=88.34ms
    ✓ 'p(99)<1000' p(99)=undefined

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 178576 46.49561/s
    checks_succeeded...................: 99.99% 178575 out of 178576
    checks_failed......................: 0.00%  1 out of 178576

    ✓ status is 200
    ✗ response time < 500ms
      ↳  99% — ✓ 89287 / ✗ 1

    HTTP
    http_req_duration.......................................................: avg=82.51ms min=79.69ms med=81.67ms max=859.42ms p(90)=87.01ms p(95)=88.34ms
      { expected_response:true }............................................: avg=82.51ms min=79.69ms med=81.67ms max=859.42ms p(90)=87.01ms p(95)=88.34ms
    http_req_failed.........................................................: 0.00% 0 out of 89288
    http_reqs...............................................................: 89288 23.247805/s

    EXECUTION
    iteration_duration......................................................: avg=2.08s   min=1.08s   med=2.08s   max=3.16s    p(90)=2.88s   p(95)=2.98s  
    iterations..............................................................: 89288 23.247805/s
    vus.....................................................................: 1     min=1          max=50
    vus_max.................................................................: 50    min=50         max=50

    NETWORK
    data_received...........................................................: 57 MB 15 kB/s
    data_sent...............................................................: 46 MB 12 kB/s



running (1h04m00.7s), 00/50 VUs, 89288 complete and 0 interrupted iterations
default ✓ [======================================] 00/50 VUs  1h4m0s